Repository: Pira019/IccPlanner
Catalog: Shared/Ressources/ValidationMessages.*.resx
Languages: fr_fr

source: Bad request
fr_fr: Mauvaise requête.

# CANNOT_CONTAIN_NULL
source: {PropertyName} must not contain any null values.
fr_fr: {PropertyName} ne doit contenir aucune valeur nulle.

# DATE
source: The date
fr_fr: La date

# DEPARTMENT
source: The department
fr_fr: Le département

source: Department
fr_fr: Départements

# DEPARTMENT_EXIST
source: The department « {PropertyValue} » already exists.
fr_fr: Le département « {0} » existe déjà.

# DEPARTMENT_INVALID_IDS
source: One or more department identifiers are invalid.
fr_fr: Un ou plusieurs identifiants de départements sont invalides.

source: Department name
fr_fr: Le nom du département

# DEPARTMENT_NOT_EXIST
source: This department not exist.
fr_fr: Ce programme n’existe pas.

source: Description
fr_fr: La description

# ERROR_UNDEFINED
source: Unknown error. Please try again later.
fr_fr: Erreur inconnue. Veuillez réessayer plus tard.

# EXIST
source: {PropertyName} « {PropertyValue} » already exist.
fr_fr: {PropertyName} « {PropertyValue} » existe déjà.

# FILE
source: The file
fr_fr: Le fichier

# FILE_TOO_LARGE
source: The file is too large, the maximum allowed size is {0} MB.
fr_fr: Le fichier est trop volumineux, la taille maximale autorisée est de {0} Mo.

# FORBIDDEN_ACCESS
source: Forbidden. You do not have the necessary permissions to access this resource.
fr_fr: Accès interdit. Vous n'avez pas les permissions nécessaires pour accéder à cette ressource.

# INVALID_PRG_TYPE
source: Invalid program type. Allowed values are: Recurring ,Punctual
fr_fr: Type de programme invalide. Les valeurs autorisées sont : Récurrent, Ponctuel.

# INVALID_ENTRY
source: {PropertyName} is invalid.
fr_fr: {PropertyName} n’est pas valide.

# INVALID_FILE_DATA
source: The file data is invalid. Please check the columns and their content.
fr_fr: Les données du fichier sont invalides. Vérifiez les colonnes et leur contenu.

# INVALID_FILE_EXTENSION
source: The file extension is not allowed.
fr_fr: L'extension du fichier n'est pas autorisée.

# INVALID_FILE_FORMAT
source: The file is not a valid Excel file.
fr_fr: Le fichier n'est pas un fichier Excel valide.

# INVALID_GENDER
source: Gender must be M or F.
fr_fr: Le sexe doit être H ou F

source: Invalid login attempt.
fr_fr: Le mot de passe ou l'e-mail est incorrect.

# INVALID_NAME
source: The name must only contain letters.
fr_fr: Le nom doit être composé uniquement de lettres.

# INVALID_ON
source: On line {0}
fr_fr: La ligne {0}

# INVALID_PHONE_NUMBER
source: Phone number must contain only digits.
fr_fr: Le numéro de téléphone doit être composé uniquement de chiffres.

# MAXLENGTH
source: {0} must not exceed {1} characters
fr_fr: {0} ne peut pas dépasser {1} caractères

# MAX_LENGTH
source: {PropertyName} must not exceed {MaxLength} characters.
fr_fr: {PropertyName} ne doit pas dépasser {MaxLength} caractères

source: Ministry
fr_fr: Ministère

source: Ministry name
fr_fr: Nom du ministère

# MISSING_REQUIRED_COLUMN
source: The following columns are required: PRENOM, SEXE, CONTACT.
fr_fr: Les colonnes suivantes sont obligatoires : PRENOM, SEXE, CONTACT.

# MUST_CHOOSE
source: Please select one or more {PropertyName}
fr_fr: Veuillez sélectionner un ou plusieurs {PropertyName}.

source: Name
fr_fr: Nom

# NAME_EXISTS
source: {PropertyName} is already taken.
fr_fr: {PropertyName} existe deja.

# NOT_NULL
source: {PropertyName} cannot be null.
fr_fr: {PropertyName} ne peut pas être nul.

# PROGRAM_NAME
source: The program name
fr_fr: Le nom de programme

# PROGRAM_TYPE
source: The program type
fr_fr: Le type de programme

# SHORT_NAME
source: The short name
fr_fr: Le nom court

# UNAUTHORIZED
source: Unauthorized access.
fr_fr: Accès non autorisé.

# USER_IS_LOCKED_OUT
source: User account locked out. Try again in a few minutes.
fr_fr: Compte utilisateur verrouillé. Réessayez dans quelques minutes.

# VAILID_DATE
source: {PropertyName} must be valid and not in the future.
fr_fr: {PropertyName} doit être valide et ne pas être dans le futur.

# VALIDATION_FAILED
source: One or more validation errors occurred. Please check your input and try again.
fr_fr: Une ou plusieurs erreurs de validation sont survenues. Veuillez vérifier vos données et réessayer.

source: Days
fr_fr: Les jours

# DAYS_REQUIRED
source: One or more days are required when the program is recurring.
fr_fr: Un ou plusieurs jours sont requis lorsque le programme est récurrent.

# VALID_DAYS
source: For recurring programs, each day must be a valid day of the week. Use numbers to represent days: 1 = Monday, 2 = Tuesday, ..., 7 = Sunday.
fr_fr: Chaque jour doit être un jour de la semaine valide (0 = lundi, 1 = mardi, …)

# DATES_REQUIRED
source: The date(s) are required when the program is punctual.
fr_fr: La ou les dates sont requises lorsque le programme est ponctuel.

# INVALID_ENTRIES
source: {PropertyName} '{CollectionIndex}' is invalid.
fr_fr: {PropertyName} '{CollectionIndex}' est pas invalide.

# INVALID_DATE
source: Each date must be in a valid format (yyyy-MM-dd).
fr_fr: Chaque date doit être dans un format valide (aaaa-MM-jj).

# MIN_VALUE
source: {PropertyName} must be greater than or equal to {ComparisonValue}.
fr_fr: {PropertyName} doit être supérieur ou égal à {ComparisonValue}.

# NBR_SERVICE
source: The number of service(s)
fr_fr: Le nombre de services

# DEPARTMENT_PROGRAM_EXIST
source: The department « {0} » already has a program «{1} »
fr_fr: Le département « {0} » a déjà un programme « {1} ».

source: Start time
fr_fr: Heure de début

source: End time
fr_fr: Heure de fin

# GREATER_THEN
source: {PropertyName} must be greater than {ComparisonValue}.
fr_fr: {PropertyName} doit être supérieure à {ComparisonValue}.

# MEMBER_ARIVAL_TIME
source: The member's arrival time is invalid or must not exceed the program start time.
fr_fr: L'heure d'arrivée du membre ne doit pas dépasser l'heure de début du service, ou elle est invalide.

# MEMBER
source: Members
fr_fr: Membres

# DISPLAY_NAME
source: Service display name
fr_fr: Nom affiché du service

source: Comment
fr_fr: Commentaire

# SERVICE_EXISTS
source: Unable to register this service: a service named «{0}» already exists between {1} and {2}.
fr_fr: Impossible d’enregistrer ce service : un service «{0}» existe déjà entre {1} et {2}.

source: Service
fr_fr: Le service

# PROGRAM
source: The program
fr_fr: Le programme

# MEMBER_ARRIVAL
source: The member's arrival time
fr_fr: L'heure d'arrivée du membre

# ENGLISH_DAY
source: Please enter the days in English. (e.g., Monday, Tuesday, etc.)
fr_fr: Veuillez entrer les jours en anglais. (ex. : Monday, Tuesday, etc.).

# NOT_EXIST
source: {0} : No matching entry found for the specified value.
fr_fr: {0} : Aucune entrée correspondante pour la valeur spécifiée.

source: Program
fr_fr: Programme

# PGM_SERVICE_EXIST
source: Cannot add this service: the program already has one scheduled on this date and at this time.
fr_fr: Impossible d’ajouter ce service : ce programme en a déjà un prévu à cette date et à cette heure.

# SERVICE_PRG
source: Service Identifier
fr_fr: Identifiant du service

# USER_NOT_FOUND
source: Error: User not found.
fr_fr: Erreur : Utilisateur non trouvé.

# SERVICE_NOT_AVAILABITY
source: You cannot set your availability for this time slot because you are not part of the associated department.
fr_fr: Vous ne pouvez pas indiquer vos disponibilités sur ce créneau, car vous ne faites pas partie du département concerné.

# SERVICE_ALREADY_CHOSEN
source: Your availability for this service has already been recorded.
fr_fr: Vos disponibilités pour ce service ont déjà été enregistrées.

# CANT_DELETE_AVAIBILITY
source: You can no longer modify this availability because the event date has passed.
fr_fr: La modification de cette disponibilité n’est plus possible, car la date de l’activité est dépassée.

# AVAILAIBILITY_NOT_FOUND
source: Availability not found. Please try again later or contact the support team.
fr_fr: Disponibilité non trouvée. Veuillez réessayer plus tard ou contacter l’équipe de soutien.
